app/views/people/show.html.erb

SELECT "phone_numbers".* FROM "phone_numbers" WHERE "phone_numbers"."person_id" = 2
---

<% @person.phone_numbers.each do |phone| %>