app/controllers/phone_numbers_controller.rb

SELECT "phone_numbers".* FROM "phone_numbers"
---
  def index
    @phone_numbers = PhoneNumber.all

SELECT "phone_numbers".* FROM "phone_numbers" WHERE "phone_numbers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @phone_number = PhoneNumber.find(params[:id])

SELECT "phone_numbers".* FROM "phone_numbers" WHERE "phone_numbers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @phone_number = PhoneNumber.find(params[:id])

INSERT INTO "phone_numbers" ("created_at", "number", "person_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 18 Jun 2013 20:44:21 UTC +00:00], ["number", "1234567890"], ["person_id", 1], ["updated_at", Tue, 18 Jun 2013 20:44:21 UTC +00:00]]
---
  def create
    @phone_number = PhoneNumber.new(params[:phone_number])

    #format.html { redirect_to person_path(@phone_number.person), notice: 'Phone number was successfully created.' }
    respond_to do |format|
      if @phone_number.save

SELECT "phone_numbers".* FROM "phone_numbers" WHERE "phone_numbers"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "phone_numbers" SET "number" = '9998887776', "updated_at" = '2013-06-18 22:09:26.846184' WHERE "phone_numbers"."id" = 6
---
  def update
    @phone_number = PhoneNumber.find(params[:id])

    respond_to do |format|
      if @phone_number.update_attributes(params[:phone_number])

SELECT "phone_numbers".* FROM "phone_numbers" WHERE "phone_numbers"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "phone_numbers" WHERE "phone_numbers"."id" = ?  [["id", 6]]
---
  def destroy
    @phone_number = PhoneNumber.find(params[:id])
    @phone_number.destroy